# Ampere Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Ampere Property
SymbolTypeId Class See Also
---
Symbol A, indicating unit Amperes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Ampere { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Ampere As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Ampere {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace